In [105]:
# Importing all the neccessary libraries
import pandas as pd # To load files and perform tasks
import numpy as np # linear algebra
import seaborn as sns  # data visualizations
import matplotlib.pyplot as plt # data visualizations

In [2]:
#import plotly  #  interactive plotting library

In [3]:
df_cn= pd.read_csv("datasets/country_names_2_digit_codes.csv")
df_ce= pd.read_csv("datasets/currency_exchange.csv")
df_cex= pd.read_csv("datasets/glassdoor_benefits_comments.csv")
df_cnh= pd.read_csv("datasets/glassdoor_benefits_highlights.csv")
df_cnc= pd.read_csv("datasets/glassdoor_breadCrumbs.csv")
df_goc= pd.read_csv("datasets/glassdoor_overview_competitors.csv")
df_f= pd.read_csv("datasets/glassdoor_photos.csv")
df_grv= pd.read_csv("datasets/glassdoor_reviews_val_reviewResponses.csv")
df_gr= pd.read_csv("datasets/glassdoor_reviews.csv")
df_gss= pd.read_csv("datasets/glassdoor_salary_salaries.csv")
df_gwv= pd.read_csv("datasets/glassdoor_wwfu_val_captions.csv")
df_gwvp= pd.read_csv("datasets/glassdoor_wwfu_val_photos.csv")
df_gwvv= pd.read_csv("datasets/glassdoor_wwfu_val_videos.csv")
df_gww= pd.read_csv("datasets/glassdoor_wwfu.csv")
df_g= pd.read_csv("datasets/glassdoor.csv")

In [4]:
df_cn

                  Name Code
0          Afghanistan   AF
1       Ã…land Islands   AX
2              Albania   AL
3              Algeria   DZ
4       American Samoa   AS
..                 ...  ...
244  Wallis and Futuna   WF
245     Western Sahara   EH
246              Yemen   YE
247             Zambia   ZM
248           Zimbabwe   ZW

[249 rows x 2 columns]

In [5]:
df_cn.head(1)

          Name Code
0  Afghanistan   AF

In [6]:
df_ce.head(1)

  Code                     Country    Currency  Number  ExchangeRate
0  AED  United Arab Emirates (The)  UAE Dirham   784.0      3.672779

In [7]:
df_cex.head(1)

,id,index,benefits.comments.val.city,benefits.comments.val.comment,benefits.comments.val.createDate,benefits.comments.val.currentJob,benefits.comments.val.jobTitle,benefits.comments.val.rating,benefits.comments.val.state
0,401,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
df_cnh.head(1)

,id,benefits.highlights.val.highlightPhrase,benefits.highlights.val.icon,benefits.highlights.val.name,index,benefits.highlights.val.commentCount
0,44001,good flexibility for working from home,wfh,Work From Home,0.0,17.0

In [9]:
df_cnc.head(1)

      id  index breadCrumbs.val.name breadCrumbs.val.url
0  40801      0                 JOBS      /Job/index.htm

In [10]:
df_goc.head(1)

      id  index overview.competitors.val
0  12526      0                    Apple

In [11]:
df_f.head(1)

,id,index,photos.val.caption,photos.val.photoId,photos.val.photoId2x,photos.val.photoLink,photos.val.photoUrl,photos.val.photoUrl2x
0,26411,0,Mango day,10772510,10772511,/Photos/Afiniti-Office-Photos-IMG1912051.htm,https://media.glassdoor.com/lst/1436090/afinit...,https://media.glassdoor.com/lst2x/1436090/afin...

In [12]:
df_grv.head(1)

,id,index,reviews.val.reviewResponses.val.createDate,reviews.val.reviewResponses.val.helpfulCount,reviews.val.reviewResponses.val.jobTitle,reviews.val.reviewResponses.val.notHelpfulCount,reviews.val.reviewResponses.val.responseText,reviews.val.reviewResponses.val.responseTextLength,reviews.val.reviewResponses.val.totalHelpfulCount,reviews.val.reviewResponses.val.updateDate
0,6762,0,2018-05-01T03:54:11,0,NaN,0,Thank you for your review.,26,0,2018-05-02T00:23:37

In [13]:
df_grv.head(1)

,id,index,reviews.val.reviewResponses.val.createDate,reviews.val.reviewResponses.val.helpfulCount,reviews.val.reviewResponses.val.jobTitle,reviews.val.reviewResponses.val.notHelpfulCount,reviews.val.reviewResponses.val.responseText,reviews.val.reviewResponses.val.responseTextLength,reviews.val.reviewResponses.val.totalHelpfulCount,reviews.val.reviewResponses.val.updateDate
0,6762,0,2018-05-01T03:54:11,0,NaN,0,Thank you for your review.,26,0,2018-05-02T00:23:37

In [14]:
df_gr.head(1)

,id,index,reviews.val.cons,reviews.val.date,reviews.val.featured,reviews.val.helpfulCount,reviews.val.id,reviews.val.pros,reviews.val.publishedOn,reviews.val.publisher,...,reviews.val.reviewerJobTitle,reviews.val.reviewerLocation,reviews.val.reviewerStatus,reviews.val.summaryPoints.ceoApproval,reviews.val.summaryPoints.outlook,reviews.val.summaryPoints.recommend,reviews.val.title,reviews.val.adviceToManagement,reviews.val.companyResponse,reviews.val.reviewResponses
0,44001,0.0,Still not big enough in market place,"Oct 20, 2010",False,0.0,689142.0,"Great brand , Good leadership , Clear business...","Oct 20, 2010",Director,...,Director,Tokyo (Japan),Former Employee,1.0,0.0,1.0,American Express Japan - Excellent place to work,None,NaN,NaN

In [15]:
df_gss.head(1)

,id,index,salary.salaries.val.basePayCount,salary.salaries.val.jobTitle,salary.salaries.val.payPeriod,salary.salaries.val.salaryPercentileMap.payPercentile10,salary.salaries.val.salaryPercentileMap.payPercentile90,salary.salaries.val.salaryPercentileMap.payPercentile50,salary.salaries.val.salaryType
0,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
df_gwv.head(1)

     id  index  wwfu.val.captions.val
0  1407      0  Our interview process

In [17]:
df_gwvp.head(1)

     id  index                                wwfu.val.photos.val
0  2370      0  https://media.glassdoor.com/template/l/40772/f...

In [18]:
df_gwvv.head(1)

     id  index                                wwfu.val.videos.val
0  4327      0  <iframe width="560" height="315" src="https://...

In [19]:
df_gww.head(1)

,id,index,wwfu.val.body,wwfu.val.id,wwfu.val.title,wwfu.val.type,wwfu.val.videos,wwfu.val.photos,wwfu.val.captions
0,449,0,"<p><img class=""lazy"" style=""display: block; ma...",133403,About Us,CUSTOM,NaN,NaN,NaN

In [20]:
df_g.head(1)

,benefits.benefitRatingDecimal,benefits.comments,benefits.highlights,benefits.numRatings,benefits.employerSummary,breadCrumbs,gaTrackerData.category,gaTrackerData.empId,gaTrackerData.empName,gaTrackerData.empSize,...,salary.currency.displayName,salary.currency.id,salary.currency.name,salary.currency.negativeTemplate,salary.currency.new,salary.currency.positiveTemplate,salary.currency.symbol,salary.lastSalaryDate,salary.salaries,wwfu
0,0.0,2801.0,2801.0,0,NaN,2801,-1,2183810,Modus Group,501-1000,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2483.0,NaN

In [21]:
# Dividimos el DataFrame en cuatro DataFrames
df_gs = np.array_split(df_g, 8, axis=1)

In [22]:
# Asigna cada DataFrame a una variable
df_g1 = df_gs[0]
df_g2 = df_gs[1]
df_g3 = df_gs[2]
df_g4 = df_gs[3]
df_g5 = df_gs[4]
df_g6 = df_gs[5]
df_g7 = df_gs[6]
df_g8 = df_gs[7]

In [23]:
# Selecciono ciertas columnas 
df_selec1 = df_g1[["benefits.numRatings", "gaTrackerData.empId", "gaTrackerData.empName","gaTrackerData.empSize", "gaTrackerData.industry","gaTrackerData.industryId", "gaTrackerData.jobTitle", "gaTrackerData.location","gaTrackerData.locationId"]]
df_selec2 = df_g2[["gaTrackerData.sectorId", "header.advertiserType"]]
df_selec3 = df_g3[["header.jobTitle","header.locId", "header.location", "header.rating","header.normalizedJobTitle"]]
df_selec4 = df_g4[["header.payHigh","header.payLow", "header.payMed","header.payPeriod", "header.salaryHigh","job.description","job.jobTitleId"]]
df_selec5 = df_g5[["map.country","map.employerName", "map.lat","map.lng", "map.location","overview.hq","overview.industry","overview.revenue","overview.sectorId","overview.size"]]
df_selec6 = df_g6[["rating.ceo.name"]]
df_selec7 = df_g7[["salary.country.continent.id","salary.country.countryFIPS", "salary.country.currency.currencyCode","salary.country.currency.displayName", "salary.country.currency.id","salary.country.currency.name","salary.country.currencyCode"]]
df_selec8 = df_g8[["salary.country.name","salary.country.population", "salary.country.shortName","salary.currency.currencyCode","salary.salaries","wwfu"]]

In [24]:
df_g8["wwfu"].unique()

array([nan, 310.0, 311.0, ..., 6613.0, 6614.0, 6615.0], dtype=object)

In [25]:
#df_g8

In [26]:
#df_g1
#df_g2
#df_g3
#df_g4
#df_g5
#df_g6
#df_g7
#df_g8

In [27]:
df_selec7

,salary.country.continent.id,salary.country.countryFIPS,salary.country.currency.currencyCode,salary.country.currency.displayName,salary.country.currency.id,salary.country.currency.name,salary.country.currencyCode
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,4.0,UK,GBP,United Kingdom Pound (GBP),2.0,United Kingdom Pound,GBP
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...
165285,NaN,NaN,NaN,NaN,NaN,NaN,NaN
165286,4.0,UK,GBP,United Kingdom Pound (GBP),2.0,United Kingdom Pound,GBP
165287,NaN,NaN,NaN,NaN,NaN,NaN,NaN
165288,NaN,NaN,NaN,NaN,NaN,NaN,NaN
165289,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [28]:
#df_selec4

In [29]:
#df_selec4.head()

In [30]:
#df_selec1.isnull().sum()
#df_selec2.isnull().sum()
#df_selec3.isnull().sum()
#df_selec4.isnull().sum()
#df_selec5.isnull().sum()
#df_selec6.isnull().sum()
#df_selec7.isnull().sum()
df_selec8.isnull().sum()

salary.country.name              88513
salary.country.population        88513
salary.country.shortName         88513
salary.currency.currencyCode     88513
salary.salaries                  18141
wwfu                            146549
dtype: int64

In [31]:
#df_selec1.duplicated().sum()
#df_selec2.duplicated().sum()
#df_selec3.duplicated().sum()
#df_selec4.duplicated().sum()
#df_selec5.duplicated().sum()
#df_selec6.duplicated().sum()
#df_selec7.duplicated().sum()
df_selec8.duplicated().sum()

18140

In [32]:
#df_selec1.info()
#df_selec2.info()
#df_selec3.info()
#df_selec4.info()
#df_selec5.info()
#df_selec6.info()
#df_selec7.info()
df_selec8.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 165290 entries, 0 to 165289
Data columns (total 6 columns):
 #   Column                        Non-Null Count   Dtype
---  ------                        --------------   -----
 0   salary.country.name           76777 non-null   object
 1   salary.country.population     76777 non-null   object
 2   salary.country.shortName      76777 non-null   object
 3   salary.currency.currencyCode  76777 non-null   object
 4   salary.salaries               147149 non-null  object
 5   wwfu                          18741 non-null   object
dtypes: object(6)
memory usage: 7.6+ MB

# __---------------------------------------------------------------------------__

# __Moneda__

In [33]:
'''
MONEDA: "header.payHigh","header.payLow", "header.payMed","header.payPeriod", "header.salaryHigh", 
"salary.country.continent.id","salary.country.countryFIPS", "salary.country.currency.currencyCode","salary.country.currency.displayName", "salary.country.currency.id",
"salary.country.currency.name","salary.country.currencyCode", "salary.country.name","salary.country.population", "salary.country.shortName","salary.currency.currencyCode",
"salary.salaries","wwfu'   '''

'\nMONEDA: "header.payHigh","header.payLow", "header.payMed","header.payPeriod", "header.salaryHigh", \n"salary.country.continent.id","salary.country.countryFIPS", "salary.country.currency.currencyCode","salary.country.currency.displayName", "salary.country.currency.id",\n"salary.country.currency.name","salary.country.currencyCode", "salary.country.name","salary.country.population", "salary.country.shortName","salary.currency.currencyCode",\n"salary.salaries","wwfu\'   '

In [34]:
#Select7

#df_selec7['salary.country.countryFIPS'].unique() #Solo tiene UK and Nan
#df_selec7["salary.country.continent.id"].unique() #nan y 4.0
#df_selec7["salary.country.currency.currencyCode"].unique() #Solo GBP y nan
#df_selec7["salary.country.currency.displayName"].unique() #United Kingdom Pound (GBP) y nan
#df_selec7["salary.country.currency.id"].unique() #2.0 y nan
#df_selec7["salary.country.currency.name"].unique()# United Kingdom pound
#df_selec7["salary.country.currencyCode"].unique()#GBP y nan


#Select8

#df_selec8["salary.country.name"].unique() #United Kingdom y nan
#df_selec8["salary.country.population"].unique() # nan y 60363602.0
#df_selec8["salary.country.shortName"].unique() # nan y UK
#df_selec8['salary.currency.currencyCode'].unique() # nan y GBP, USD, EUR, CHF, CAD

#Select4

#df_selec4["header.payPeriod"].unique() #nan, ANNUAL, HOURLY

#Select7

# df_selec7['salary.country.currency.currencyCode'].unique() #nan y GBP

In [35]:
#df_selec8["salary.currency.currencyCode"].sample(50)
#df_selec8[df_selec8["salary.currency.currencyCode"] == "USD"].sample(50)

#DATOS DE LA COLUMNA salary.currency.currency.Code

#(df_selec8["salary.currency.currencyCode"] == "USD").sum() #56 USD
#(df_selec8["salary.currency.currencyCode"] == "EUR").sum() # 61 EUR
#(df_selec8["salary.currency.currencyCode"] == "CHF").sum() # 6 CHF
#(df_selec8["salary.currency.currencyCode"] == "CAD").sum()  # 2 CAD
#(df_selec8["salary.currency.currencyCode"] == "GBP").sum() # 76652, eso sin contar lo que se tiene para complementar de los otros

In [36]:
print('header payHigh: ',df_selec4['header.payHigh'].unique(),'\nheader paylow: ',
df_selec4['header.payLow'].unique(),'\nheader paymed: ',
df_selec4['header.payMed'].unique(),'\nheader payPeriod: ',
df_selec4['header.payPeriod'].unique(),'\nheader salary high: ',
df_selec4['header.salaryHigh'].unique(),'\n',
)
print('\n','\n','\n','\n','-Nulos-')

print(df_selec4['header.payHigh'].isnull().sum(),
df_selec4['header.payLow'].isnull().sum(),
df_selec4['header.payMed'].isnull().sum(),
df_selec4['header.payPeriod'].isnull().sum(),
df_selec4['header.salaryHigh'].isnull().sum())

header payHigh:  [nan 182160.0 136276.0 ... 116887.0 100885.0 107219.0]
header paylow:  [nan 132630.0 93444.0 ... 77999.0 66689.0 68090.0]
header paymed:  [nan 159427.0 115139.0 ... 96171.0 82206.0 86238.0]
header payPeriod:  [nan 'ANNUAL' 'HOURLY']
header salary high:  [nan 182160.0 136276.0 ... 116887.0 100885.0 107219.0]





 -Nulos-
161628 161628 161648 161653 161628

In [37]:
print('salary.country.continent.id: ',df_selec7['salary.country.continent.id'].unique(),'\nsalary.country.countryFIPS: ',
df_selec7['salary.country.countryFIPS'].unique(),'\nsalary.country.currency.currencyCode: ',
df_selec7['salary.country.currency.currencyCode'].unique(),'\nsalary.country.currency.displayName: ',
df_selec7['salary.country.currency.displayName'].unique(),'\nsalary.country.currency.id: ',
df_selec7['salary.country.currency.id'].unique(),'\nsalary.country.currency.name',
df_selec7['salary.country.currency.name'].unique(),'\nsalary.country.currencyCode: ',
df_selec7['salary.country.currencyCode'].unique(),'\n',
)
print('\n','\n','\n','\n','-Nulos-')

print(df_selec7['salary.country.continent.id'].isnull().sum(),
df_selec7['salary.country.countryFIPS'].isnull().sum(),
df_selec7['salary.country.currency.currencyCode'].isnull().sum(),
df_selec7['salary.country.currency.displayName'].isnull().sum(),
df_selec7['salary.country.currency.id'].isnull().sum(),
df_selec7['salary.country.currency.name'].isnull().sum(),
df_selec7['salary.country.currencyCode'].isnull().sum())

salary.country.continent.id:  [nan 4.0]
salary.country.countryFIPS:  [nan 'UK']
salary.country.currency.currencyCode:  [nan 'GBP']
salary.country.currency.displayName:  [nan 'United Kingdom Pound (GBP)']
salary.country.currency.id:  [nan 2.0]
salary.country.currency.name [nan 'United Kingdom Pound']
salary.country.currencyCode:  [nan 'GBP']





 -Nulos-
88513 88513 88513 88513 88513 88513 88513

In [38]:
print('salary.country.name: ',df_selec8['salary.country.name'].unique(),'\nsalary.country.population: ',
df_selec8['salary.country.population'].unique(),'\nsalary.country.shortName: ',
df_selec8['salary.country.shortName'].unique(),'\nsalary.currency.currencyCode: ',
df_selec8['salary.currency.currencyCode'].unique(),'\nsalary.salaries: ',
df_selec8['salary.salaries'].unique(),'\nwwfu: ',
df_selec8['wwfu'].unique(),'\n',
)
print('\n','\n','\n','\n','-Nulos-')

print(df_selec8['salary.country.name'].isnull().sum(),
df_selec8['salary.country.population'].isnull().sum(),
df_selec8['salary.country.shortName'].isnull().sum(),
df_selec8['salary.currency.currencyCode'].isnull().sum(),
df_selec8['salary.salaries'].isnull().sum(),
df_selec8['wwfu'].isnull().sum())

salary.country.name:  [nan 'United Kingdom']
salary.country.population:  [nan 60363602.0]
salary.country.shortName:  [nan 'UK']
salary.currency.currencyCode:  [nan 'GBP' 'USD' 'EUR' 'CHF' 'CAD']
salary.salaries:  [2483.0 2484.0 2485.0 ... 52077.0 52078.0 52079.0]
wwfu:  [nan 310.0 311.0 ... 6613.0 6614.0 6615.0]





 -Nulos-
88513 88513 88513 88513 18141 146549

In [39]:
#Creacion de la columna valor promedio
#df_economy['avg_salary'] = df_selec4[["header.payHigh","header.payLow", "header.payMed"]].mean(axis=1)

In [40]:
#Metodo para meter datos de un df al otro en las partes nulas: df_economy = df1.combine_first(df2)

In [41]:
#Primera parte del dataset
df_p1 = df_selec4[["header.payHigh","header.payLow", "header.payMed", "header.salaryHigh", "header.payPeriod"]]
df_p2 = df_selec8[["salary.salaries"]]
df_p3 = df_selec7[["salary.country.currency.currencyCode"]]

df_use = pd.concat([df_p1, df_p2, df_p3], axis=1)

In [42]:
df_use

,header.payHigh,header.payLow,header.payMed,header.salaryHigh,header.payPeriod,salary.salaries,salary.country.currency.currencyCode
0,NaN,NaN,NaN,NaN,NaN,2483.0,NaN
1,NaN,NaN,NaN,NaN,NaN,2484.0,GBP
2,NaN,NaN,NaN,NaN,NaN,2485.0,NaN
3,NaN,NaN,NaN,NaN,NaN,2486.0,NaN
4,NaN,NaN,NaN,NaN,NaN,2487.0,NaN
...,...,...,...,...,...,...,...
165285,NaN,NaN,NaN,NaN,NaN,52075.0,NaN
165286,NaN,NaN,NaN,NaN,NaN,52076.0,GBP
165287,NaN,NaN,NaN,NaN,NaN,52077.0,NaN
165288,NaN,NaN,NaN,NaN,NaN,52078.0,NaN
165289,NaN,NaN,NaN,NaN,NaN,52079.0,NaN

In [43]:
df_use['header.salaryHigh'][df_use['header.salaryHigh'].notnull()].sample(5)

76783     124644.0
71842      61727.0
53277     123301.0
108824     70477.0
121792     69130.0
Name: header.salaryHigh, dtype: object

In [45]:
df_use

,header.payHigh,header.payLow,header.payMed,header.salaryHigh,header.payPeriod,salary.salaries,salary.country.currency.currencyCode
0,NaN,NaN,NaN,NaN,NaN,2483.0,NaN
1,NaN,NaN,NaN,NaN,NaN,2484.0,GBP
2,NaN,NaN,NaN,NaN,NaN,2485.0,NaN
3,NaN,NaN,NaN,NaN,NaN,2486.0,NaN
4,NaN,NaN,NaN,NaN,NaN,2487.0,NaN
...,...,...,...,...,...,...,...
165285,NaN,NaN,NaN,NaN,NaN,52075.0,NaN
165286,NaN,NaN,NaN,NaN,NaN,52076.0,GBP
165287,NaN,NaN,NaN,NaN,NaN,52077.0,NaN
165288,NaN,NaN,NaN,NaN,NaN,52078.0,NaN
165289,NaN,NaN,NaN,NaN,NaN,52079.0,NaN

### __Se normalizaron los datos utilizando el promedio de los datos existentes en base al crecimiento del promedio de cada una de las columnas de valores relevantes__

In [46]:
means = df_use.mean(axis=0)

C:\Users\matia\AppData\Local\Temp\ipykernel_26316\3916128692.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  means = df_use.mean(axis=0)

In [47]:
df_use= df_use.fillna(value=means)

In [48]:
# Paso 5: Calcular porcentaje de crecimiento o decrecimiento de cada columna
# en relación a la columna de salarios

# Primero, convierte todas las columnas a numéricas
df_use = df_use.apply(pd.to_numeric, errors='coerce')

# Calcula la diferencia entre la columna de salarios y cada una de las otras columnas
differences = df_use.subtract(df_use["salary.salaries"], axis=0)

# Calcula el porcentaje de cambio dividiendo la diferencia por el valor de la columna de salarios y multiplicando por 100
percentages = differences.divide(df_use["salary.salaries"], axis=0) * 100

# Calcula la media de los porcentajes para cada columna, ignorando los valores NaN
percentage_means = percentages.mean(skipna=True)

# Asegúrate de que las columnas no numéricas (como las cadenas de caracteres) se mantengan como NaN
percentage_means = percentage_means.where(pd.notnull(percentage_means), None)

In [49]:
differences = df_use.subtract(df_use["salary.salaries"], axis=0)

In [50]:
percentages = differences.divide(df_use["header.salaryHigh"], axis=0) * 100

In [51]:
percentage_means = percentages.mean(axis=0)

In [52]:
for col in df_use.columns:
    if df_use[col].isnull().values.any():
        df_use[col] = df_use["salary.salaries"] * (1 + percentage_means[col]/100)

In [54]:
df_use

,header.payHigh,header.payLow,header.payMed,header.salaryHigh,header.payPeriod,salary.salaries,salary.country.currency.currencyCode
0,115832.403605,77825.276898,95296.689182,115832.403605,NaN,2483.0,NaN
1,115832.403605,77825.276898,95296.689182,115832.403605,NaN,2484.0,NaN
2,115832.403605,77825.276898,95296.689182,115832.403605,NaN,2485.0,NaN
3,115832.403605,77825.276898,95296.689182,115832.403605,NaN,2486.0,NaN
4,115832.403605,77825.276898,95296.689182,115832.403605,NaN,2487.0,NaN
...,...,...,...,...,...,...,...
165285,115832.403605,77825.276898,95296.689182,115832.403605,NaN,52075.0,NaN
165286,115832.403605,77825.276898,95296.689182,115832.403605,NaN,52076.0,NaN
165287,115832.403605,77825.276898,95296.689182,115832.403605,NaN,52077.0,NaN
165288,115832.403605,77825.276898,95296.689182,115832.403605,NaN,52078.0,NaN
165289,115832.403605,77825.276898,95296.689182,115832.403605,NaN,52079.0,NaN

In [55]:
differences

,header.payHigh,header.payLow,header.payMed,header.salaryHigh,header.payPeriod,salary.salaries,salary.country.currency.currencyCode
0,113349.403605,75342.276898,92813.689182,113349.403605,NaN,0.0,NaN
1,113348.403605,75341.276898,92812.689182,113348.403605,NaN,0.0,NaN
2,113347.403605,75340.276898,92811.689182,113347.403605,NaN,0.0,NaN
3,113346.403605,75339.276898,92810.689182,113346.403605,NaN,0.0,NaN
4,113345.403605,75338.276898,92809.689182,113345.403605,NaN,0.0,NaN
...,...,...,...,...,...,...,...
165285,63757.403605,25750.276898,43221.689182,63757.403605,NaN,0.0,NaN
165286,63756.403605,25749.276898,43220.689182,63756.403605,NaN,0.0,NaN
165287,63755.403605,25748.276898,43219.689182,63755.403605,NaN,0.0,NaN
165288,63754.403605,25747.276898,43218.689182,63754.403605,NaN,0.0,NaN
165289,63753.403605,25746.276898,43217.689182,63753.403605,NaN,0.0,NaN

In [62]:
df_selec7['salary.country.currency.currencyCode'].unique()

array([nan, 'GBP'], dtype=object)

### __Creamos una funcion para ver si podemos complementar datos de otras columnas__

In [83]:
#busca comparar el valor de una columna específica en dos dataframes distintos y determinar si sería útil combinarlos usando el método combine_first().
#La idea detrás de este proceso es que en algunos casos, puede haber datos faltantes en un dataframe que se puedan completar con información de otro dataframe.


def compare_cols(df1, df2, col1, col2):
    if col1 not in df1.columns:
        print(f"La columna {col1} no se encuentra en el primer dataframe.")
    elif col2 not in df2.columns:
        print(f"La columna {col2} no se encuentra en el segundo dataframe.")
    elif df1[col1].isnull().all() or df2[col2].isnull().all():
        print("Uno de los dataframes no tiene valores en la columna especificada.")
    elif df1.index.equals(df2.index):
        nulls1 = df1[col1].isnull().sum()
        nulls2 = df2[col2].isnull().sum()
        if nulls1 > 0 and nulls2 == 0:
            print("Este dataframe puede ser utilizado para combinar con el otro usando .combine_first().")
        elif nulls2 > 0 and nulls1 == 0:
            print("El otro dataframe puede ser utilizado para combinar con este usando .combine_first().")
        else:
            print("Ambos dataframes tienen valores en la columna especificada.")
    else:
        print("Los dataframes tienen índices diferentes.")

In [84]:
compare_cols(df_selec7, df_selec7, 'salary.country.currency.currencyCode', 'salary.country.currencyCode')

Ambos dataframes tienen valores en la columna especificada.

In [92]:
compare_cols(df_selec7, df_selec8, 'salary.country.currency.currencyCode', 'salary.currency.currencyCode')

Ambos dataframes tienen valores en la columna especificada.

In [94]:
compare_cols(df_selec7, df_selec7, 'salary.country.currency.currencyCode', "salary.country.currency.displayName")

Ambos dataframes tienen valores en la columna especificada.

In [95]:
compare_cols(df_selec7, df_selec7, 'salary.country.currency.currencyCode', "salary.country.currency.name")

Ambos dataframes tienen valores en la columna especificada.

### __Creacion de la parte economica del dataframe__

In [103]:
#Concatenamos todas las filas que necesitamos
df_pa = df_use[["salary.salaries"]]
df_pb = differences[["header.payHigh", "header.payLow",	"header.payMed", "header.salaryHigh"]]
df_pc = df_selec4[["header.payPeriod"]]
df_d = df_selec7['salary.country.currency.currencyCode']


df_economy = pd.concat([df_pa, df_pb, df_pc, df_d], axis=1)

In [104]:
df_economy.sample(6)

,salary.salaries,header.payHigh,header.payLow,header.payMed,header.salaryHigh,header.payPeriod,salary.country.currency.currencyCode
94749,25553.0,90279.403605,52272.276898,69743.689182,90279.403605,NaN,GBP
30368,73575.0,42257.403605,4250.276898,21721.689182,42257.403605,NaN,NaN
94088,32811.0,83021.403605,45014.276898,62485.689182,83021.403605,NaN,GBP
163450,31522.0,84310.403605,46303.276898,63774.689182,84310.403605,NaN,GBP
37337,478.0,115354.403605,77347.276898,94818.689182,115354.403605,NaN,GBP
43222,74849.0,40983.403605,2976.276898,20447.689182,40983.403605,NaN,GBP